Revit 2027 API
ParameterTypeId.WitnsLineExtension Property
 "Witness Line Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WitnsLineExtension { get; }
Public Shared ReadOnly Property WitnsLineExtension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WitnsLineExtension {
	ForgeTypeId^ get ();
}
static member WitnsLineExtension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace